Revit 2027 API
RenderingQualitySettings.IsCustomQuality Method
 Checks if the current rendering quality is custom or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCustomQuality()
Public Function IsCustomQuality As Boolean
public:
bool IsCustomQuality()
member IsCustomQuality : unit -> bool
Return Value
Boolean
 True if the current rendering quality is custom, false otherwise.
See Also
Reference
RenderingQualitySettings Class
Autodesk.Revit.DB Namespace